{"intents": [
		{"tag": "CAF-General",
		 "patterns": ["What does CAF stand for?", "What do we mean by CAF?", "CAF in France","Student CAF in France", "What is CAF?"],
		 "responses": ["CAF stands for Caisse d'Allocations Familiales which offers state allowances to assist students in France with rental cost", "CAF is a state allowance which assist students with rental cost.", "Depending on monthly expenditures, location and type of housing students can receive 80€ - 170€ per month from the French government to assist with rental costs.", "CAF is a state allowance which assist students with rental cost. Depending on monthly expenditures, location and type of housing students can receive 80€ - 170€ per month from the French government.","CAF is a state allowance which assist students with rental cost in France."]
		},
		{"tag": "CAF-eligibility",
		 "patterns": ["Who can benefit from CAF?", "Can a non-European student get CAF?","What type of visa do I need to get CAF?", "What type of accommodation should I have to get CAF?", "I am a student living with my partner, can I get CAF?", "Can students benefit from CAF?","Can I get CAF if I am no longer a student?", "Can I get CAF after I graduate?","Can I get CAF while looking for a job?", "Who is eligible for CAF?"],
		 "responses": ["French Students, European or ERASMUS students and International Students with a valid student visa.", "Non-European students coming from outside of the EU with a valid student visa can benefit from CAF.","To be eligible for CAF, International students from outside the EU require an OFII validated long-term VLS-TS visa", "All accommodation types are eligible with one exception, your parents or grandparents CANNOT be the landlord.", "Private accommodation; homestays; accommodation with roommates and accommodation for a couple are all eligible for CAF.","French Students, European or ERASMUS students and International Students with a valid student visa can all benefit from CAF","If you are no longer a student, your status changed and accordingly your profile might no longer be eligible for CAF for students. Other state allowances might be relevant depending on your situation. You can check caf.fr for more information.", "After graduation, your student status is no longer valid and accordingly your profile might no longer be eligible for CAF for students. Other state allowances might be relevant depending on your situation. You can check caf.fr for more information.", "If you are looking for a job after graduation, your student status is no longer valid and accordingly your profile might no longer be eligible for CAF for students. Other state allowances might be relevant depending on your situation. You can check caf.fr for more information.", "French Students, European or ERASMUS students and International Students with a valid student visa are all eligible for CAF."]
		},
		{"tag": "CAF-process",
		"patterns": ["How to apply for CAF?", "Where to apply for CAF?","Where can I submit an application for CAF?", "When can I apply for CAF?","Where can I apply for CAF in English?", "Can I apply for CAF before I arrive to France?", "When do I start getting money from CAF?", "When do I start getting paid by CAF?", "When will CAF pay me?", "How long does it take to get CAF?", "When do I recieve monthly payments from CAF?", "How can I apply for CAF?" ],
		"responses": ["To apply, please complete the online application form available on caf.fr", "You can apply for CAF online by going to their website caf.fr", "Your CAF application request and all documents can be submitted online on caf.fr","You can apply for CAF within 2 months of your arrival in your accommodation and allocations will be paid for the first full month of paid rent.","Unfortunately, the application process is not available in English.The International Student Office is available for support","Students can only apply ti CAF after their arrival in their accommodation because the CAF processes requires the submission of a validated visa which can only be obtained after a student's arrival to France","If you move on the 25 August then you won’t get any benefits for August (the first month), but you can get benefits for September (the second month)", "CAF will start paying your rent subsidy the second complete month you stay in your accommodation", "If you have submitted a complete and validated application,CAF will start paying your rent subsidy the second complete month you stay in your accommodation.","If all the required documents are submitted, you can expect to get assistance from CAF in 30 days.","Monthly payments from CAF are usually released on the 5th of every month","To apply for CAF, please complete the online application form available on caf.fr"]
		},
		{"tag": "CAF-changes",
		"patterns":["How can I cancel CAF?", "If I move to a new appartment should I change CAF?" ,"I am relocating, how to change my CAF?", "Do I need to inform CAF if I move to a new place?","I am leaving France, should I cancel my CAF", "Delay in CAF payment", "I did not recieve my payment this month"],
		"responses": ["To cancel your CAF, you must inform the CAF 2 weeks in advance", "In case you are moving to a new appartment, you should inform CAF via your online account","If you are relocating, you must inform CAF via your online account", "If you are moving to a new place, you must inform CAF.","If you are changing your address, you must update your status on your CAF account. According to your new situation, your CAF might be updated or cancelled.", "If there are delays in CAF payment, it might be that your CAF is requesting more information, please visit your online account to know more.", "If you did not receive your CAF payment this month,it might be that your CAF is requesting more information, please visit your online account to know more."]
		},
		{"tag": "CAF-documents",
		"patterns":["What documents do I need to apply for CAF?", "Where can I get a SIRET number?", "Do I need a birth cerificate for CAF?", "I do not work, but CAF asks for personal revenue", "CAF is asking about social security number but I do not have one", "I do not have a social security number to complete CAF application", "Do I need a social security number to submit a CAF application?", "CAF required documents","What are the needed documents for CAF?"],
		"responses": ["To apply for CAF, you need the following documents: Rental agreement, SIRET number of your agency or landlord, Bank account information (IBAC + BIC), Personal revenue for Jan-Dec from two years ago. (If you did not work you can click on no revenue). You do not need to upload this document, Passport or European ID,  Visa with OFII validation or European EHIC Card,TBS Enrollment Letter, TBS Student ID Card, Legal Birth certificate, translated into French by a sworn translator, Attestation de lodgment signed by your residence/landlord.", "The SIRET number is needed for your CAF application. You can ask your landlord or agency to provide you with their SIRET number which identifies them.", "A legal birth certificate, translated into French by a sworn translator is a required document for your CAF application.", "If you did not work in France for the past two years, then you do not need to submit your personal revenues. You can click on no revenue.","You do not need a social security number to submit a CAF application. Please leave this field empty in your application", "You do not need a social security number to complete a CAF application. Please leave this field empty in your application", "You do not need a social security number to submit a CAF application","To apply for CAF, you need the following documents: Rental agreement, SIRET number of your agency or landlord, Bank account information (IBAC + BIC), Personal revenue for Jan-Dec from two years ago. (If you did not work you can click on no revenue). You do not need to upload this document, Passport or European ID,  Visa with OFII validation or European EHIC Card,TBS Enrollment Letter, TBS Student ID Card, Legal Birth certificate, translated into French by a sworn translator, Attestation de lodgment signed by your residence/landlord.","To apply for CAF, you need the following documents: Rental agreement, SIRET number of your agency or landlord, Bank account information (IBAC + BIC), Personal revenue for Jan-Dec from two years ago. (If you did not work you can click on no revenue). You do not need to upload this document, Passport or European ID,  Visa with OFII validation or European EHIC Card,TBS Enrollment Letter, TBS Student ID Card, Legal Birth certificate, translated into French by a sworn translator, Attestation de lodgment signed by your residence/landlord."]
	},
	{
            "tag": "bank_account_opening",
            "patterns": ["What documents do I need to open a bank account?", "Can I open a bank account as an international student?", "What types of bank accounts do you offer?", "How long does it take to open a bank account?", "Do I need to have a social security number to open a bank account?","How much money do I need to deposit to open a savings account?","What are the requirements to open a student account","Do you offer any incentives or bonuses for opening a new account?"],
            "responses": ["To open a bank account, you'll need to provide a valid passport and visa, proof of enrollment in a U.S. school, and proof of address.", "Yes, you can open a bank account as an international student with the required documentation.", "We offer checking, savings, and student accounts. Please speak to a bank representative to determine which account is right for you.", "The time it takes to open a bank account can vary depending on the bank and the type of account you choose. Typically, it takes 30 minutes to an hour.", "No, you don't need a social security number to open a bank account. However, you may require it for certain types of accounts.","The minimum deposit required to open a savings account is $XX.", "To open a student account, you'll need to provide proof of enrollment in a school.", "Yes, we currently have a promotion where you can receive a $50 bonus for opening a new checking account."]
        },
        {
            "tag": "account_opening",
            "patterns": ["Is it possible to open a bank account online?","How do I close my bank account?","Can I open a bank account without a driver's license?","What is the minimum deposit to open a bank account?", "Is there a monthly fee for maintaining a bank account?", "Can I open a joint bank account with another international student?", "What is the process for transferring money from my home country to my French bank account?", "Can I get a credit card as an international student?"],
            "responses": ["Yes, you can open a bank account online through our website","To close your bank account, you can either visit a branch or contact our customer service department","Yes, you can open a bank account without a driver's license. A passport or state ID can be used as identification.","The minimum deposit to open a bank account can vary depending on the bank and the type of account you choose. Please speak to a bank representative for more information.", "Some bank accounts may have a monthly fee for maintaining the account. Please speak to a bank representative to determine which account is right for you.", "Yes, you can open a joint bank account with another international student with the required documentation.", "To transfer money from your home country to your U.S. bank account, you can use a wire transfer service or a third-party money transfer service. Please speak to a bank representative for more information.", "As an international student, you may be eligible for a credit card with a limited credit history. Please speak to a bank representative to determine your eligibility."]
        },
        {
            "tag": "account_balance",
            "patterns": ["What is the balance in my savings account?","Can you provide a detailed breakdown of my account balance?","How much money did I spend on my last transaction?","What is my account balance?", "Can you tell me my account balance?", "How much money do I have in my account?", "How much money do I owe?"],
            "responses": ["The current balance in your savings account is $XX.","You can view a detailed breakdown of your account balance by logging in to your online banking account or mobile app.","The last transaction on your account was for $XX on [date].","To check your account balance, please log in to your online banking account or mobile app.", "You can check your account balance by calling our customer service number.","To check how much money you owe please connect on the mobile app" ,"Your current account balance is $X."]
        },
        {
            "tag": "transaction_history",
            "patterns": ["How can I check my transaction history?", "Can you show me my transaction history?", "Where can I find my transaction history?", "What transactions have been posted to my account?"],
            "responses": ["You can view your transaction history by logging in to your online banking account or mobile app.", "You can request a copy of your transaction history by calling our customer service number.", "Here are your recent transactions: [list of transactions]", "Connect to the mobile app to have the history of your transaction"]
        },
        {
            "tag": "transfer_money",
            "patterns": ["How long does it take to transfer money to another account?","What is the maximum amount I can transfer in a day?","Can I cancel a transfer after it has been initiated?","How can I transfer money to another account?", "Can I transfer money to another bank?", "What's the process for making a wire transfer?", "Can I transfer money internationally?"],
            "responses": ["The time it takes to transfer money can vary depending on the destination and the type of transfer. Typically, it takes 1-3 business days.","The maximum amount you can transfer in a day is $XX.","Once a transfer has been initiated, it cannot be canceled. Please ensure that all details are correct before initiating a transfer.","You can transfer money to another account through your online banking account or mobile app.", "To make a wire transfer, please visit your local branch or call our customer service number.", "International transfers may incur additional fees. Please consult our fee schedule for more information.", "For any international transfers please contact your bank agent"]
        },
        {
            "tag": "credit_card",
            "patterns": ["What happens if I miss a credit card payment?","Can I transfer a balance from another credit card to my account?","What is the interest rate on my credit card?","How can I apply for a credit card?", "What are the credit card options available?", "What's the credit limit on my card?", "Can I request a credit limit increase?"],
            "responses": ["If you miss a credit card payment, you may be charged a late fee and your credit score may be negatively impacted.","Yes, you can transfer a balance from another credit card to your account. Please contact our customer service department for more information.","The current interest rate on your credit card is XX%.","You can apply for a credit card through your online banking account or by visiting your local branch.", "We offer several different credit card options with varying rewards and benefits.", "Your current credit limit is $X.", "You can request a credit limit increase through your online banking account or by calling our customer service number."]
        },
        {
            "tag": "loan_application",
            "patterns": ["What are the interest rates on your loans?","How long does it take to receive a loan decision?","What is the maximum amount I can borrow?","How can I apply for a loan?", "What types of loans are available?", "What are the requirements for a loan?", "Can I pre-qualify for a loan?"],
            "responses": ["Interest rates on our loans vary depending on the type of loan and your credit history. Please speak to a loan officer for more information.","Loan decisions typically take 1-2 business days.","The maximum amount you can borrow depends on the type of loan you are applying for and your credit history.","You can apply for a loan through your online banking account or by visiting your local branch.", "We offer several different types of loans, including personal loans, auto loans, and home loans.", "Loan requirements vary depending on the type of loan you're applying for. Please consult our website or speak to a loan officer for more information.", "You can pre-qualify for a loan by filling out an application on our website."]
        },
         {
            "tag": "loan_repayment",
            "patterns": ["How do I make a loan payment?", "What's the deadline for my next loan payment?", "What happens if I miss a loan payment?", "Can I set up automatic loan payments?"],
            "responses": ["You can make a loan payment through your online banking account or by visiting your local branch.", "Your loan payment is due on the Xth of each month.", "If you miss a loan payment, you may be charged a late fee. Please refer to your loan agreement for more information.", "Yes, you can set up automatic loan payments through your online banking account or by calling our customer service number."]
        },
        {
            "tag": "fraud_prevention",
            "patterns": ["I think my account has been hacked!", "Someone has stolen my debit/credit card!", "What should I do if I suspect fraud?", "How can I protect myself from identity theft?"],
            "responses": ["If you suspect fraud on your account, please contact our customer service number immediately to report it.", "If your debit/credit card has been stolen, please call our customer service number to report it and request a replacement card.", "If you suspect fraud, we recommend that you change your account passwords and enable two-factor authentication.", "To protect yourself from identity theft, you should regularly check your credit report and monitor your accounts for suspicious activity."]
        },
        {
            "tag": "lost_credit_card",
            "patterns": ["I lost my credit card, how can i lock it ? ", "What if i lost my credit card ?", "Can I lock  my credit card when I lose it ?"],
            "responses": ["You can remotly lock/unlock your credit card with our mobile app -> Go to Menu Select Manage Debit Card/Credit Card -> Select the card you want to manage -> Toggle to Lock or Unlock under the card image", "If you lost your credit card report it directly with the app, where you can lock it", "Sure, to do so please connect to our app!"]

        },
        {
            "tag": "lost_ID_Password",
            "patterns": ["I lost my credentials", "I cant remeber my password", "I may lost my ID number"],
            "responses": ["If you lost your credentials, you can contact your bank agent and local agence","Please contact customer service number, some basic information will be asked as Card or Account number and Social Security Number", "Please connect to banking mobile app"]

        },
        {
            "tag": "student_loan",
            "patterns": ["What types of student loans are available?", "What is the interest rate on student loans?", "What is the repayment period for student loans?", "Can I defer my student loans if I go back to school?", "What happens if I can't make my student loan payments?", "How do I apply for student loan forgiveness?", "Can I refinance my student loans?", "What is the process for consolidating my student loans?", "What happens if I pay off my student loans early?"],
            "responses": ["There are several student loans available with interresting rate. Please speak to a bank representative for more information on your options.", "If you can't make your student loan payments, you have a few options. You can try to work out a new payment plan with your lender. You can also consolidate your loans, which can lower your monthly payments.","You are eligible for this deferment if you're enrolled at least half-time at an eligible college or career school","You can refinance student loans as often as you'd like. If you've already refinanced and your credit has recently improved, consider refinancing again to lock in a lower rate. ","The interest rate on student loans can vary depending on the type of loan and your credit history. Please speak to a bank representative for more information.", "To be eligible for student loan forgiveness, your annual income must have fallen below a certain amount, please contact your bank agent","The repayment period for student loans can vary depending on the type of loan and your payment plan. Please speak to a bank representative for more information.", "If you go back to school, you may be able to defer your student loans.", "If tou pay off your student loans only you will be free of interest rates"]
        },
        {
        "tag" : "foreign_currency_exchange",
        "patterns": [
            "How can I exchange currency at your bank?",
            "What exchange rate will I receive for my foreign currency?",
            "Are there any fees associated with foreign currency exchange?",
            "Is there a minimum or maximum amount of foreign currency I can exchange?",
            "How long does it take to exchange foreign currency?",
            "Can I exchange foreign currency at any bank location?",
            "What types of foreign currency do you accept for exchange?",
            "Can I exchange foreign currency without having a bank account with you?",
            "How can I check the current exchange rates for different currencies?",
            "Are there any restrictions on the amount of foreign currency I can bring into the country?"
        ],
        "responses": [
            "You can exchange foreign currency at any of our bank locations. Please speak to a bank representative for more information.",
            "The exchange rate for foreign currency can vary depending on the market and the type of currency you are exchanging. Please speak to a bank representative for more information.",
            "There may be fees associated with foreign currency exchange. Please speak to a bank representative for more information on the fees that may apply to your specific transaction.",
            "There may be minimum or maximum amounts of foreign currency that can be exchanged depending on the bank's policies. Please speak to a bank representative for more information.",
            "The time it takes to exchange foreign currency can vary depending on the type of transaction and the amount of currency being exchanged. Please speak to a bank representative for more information.",
            "Yes, you can exchange foreign currency at any of our bank locations.",
            "We accept many different types of foreign currency for exchange. Please speak to a bank representative for more information on the specific currencies we accept.",
            "Yes, you can exchange foreign currency without having a bank account with us.",
            "You can check the current exchange rates for different currencies on our website or on our app bank.",
            "There may be restrictions on the amount of foreign currency you can bring into the country. Please speak to a bank representative or consult with local customs regulations for more information."]
        },
        {
        "tag" : "online_banking",
        "patterns": [
            "What features are available through online banking web site and web app?",
            "Is there a fee to use online banking?",
            "Can I transfer money between accounts through online banking?",
            "Is online banking secure?"],
        "responses": [
           "With online banking you can have direct acces to your account balance, statut transaction,...","There is no fee by using online banking website nor our app","The best way to transfer money is to use our banking app !","Online banking is secure as long as you dont communicate your credentials !"]
        },
	    {"tag" : "Visa application",
	         "patterns" : ["Where should I apply for residence?","Where should I apply for a resident card?","How can I apply for a resident card?","Where to apply for my first resident card?","Where should I apply for my first Carte de sejour?","Where to apply for my first Titre de sejour?","Where should I apply for a resident permit?","How can I have my permit to stay in France?","How can I have my resident card to stay in France?","How can I have my Titre de sejour to stay in France?","Where to apply for my first resident permit?","Where to apply for the permit to stay in France?"],
             "responses": ["You can apply it on this website: https://administration-etrangers-en-france.interieur.gouv.fr/particuliers/#/ (click Je demande ou renouvelle un titre de sejour)","On the website https://administration-etrangers-en-france.interieur.gouv.fr/particuliers/#/ you can see it."]
             },
            {"tag" : "Visa time",
	         "patterns" : ["When do I need to submit the application?","When should I apply for residence?","When should I apply for a resident card?","When to apply for my first resident card?","When should I apply for my first Carte de sejour?","When to apply for my first Titre de sejour?"],
             "responses": ["You can start the application within two months of the end of your long-stay visa and must apply before your visa expires.","At least two months before your visa expires.", "You must submit your card application to the prefecture (or sub-prefecture) of your home, 2 months before the end of your visa", "You can start the application within two months of the end of your long-stay visa and must apply before your visa expires", "The best period is to start your application 2 months before your departure", "As the demand highky fluctuate, do not hesitate to apply 2 or 3 months before your departure"]
             },
            {"tag" : "Visa document",
	         "patterns" : ["What documents do I need to apply?","Required documents for Carte de sejour application?","Required documents for the application?","Required documents for the resident card application?","What should I prepare for the application?","Things I need for the application?","What do I need to prepare before?"],
             "responses": ["It depends on what you're applying for. If you're applying for a job, you may need a resume and cover letter. If you're applying for a visa, you'll likely need a passport, photo ID, and proof of travel plans. If you're applying for a loan, you may need bank statements and proof of income.","Your long-stay visa or current carte de sejour, your passport, your full birth certificate (translated into French), proof of address (dated less than six months old), 3 x passport-style photos, OFII medical certificate", "You'll typically need a completed application form, a valid passport, proof of residence in France, proof of income, proof of health insurance, and any other supporting documents specific to your situation.", "The required documents will vary depending on what you're applying for. Generally, you'll need to provide some form of identification (e.g. passport, driver's license), proof of address (e.g. utility bill), and any additional documents specific to your application (e.g. proof of income, letters of recommendation).", "You'll typically need a completed application form, a valid passport, proof of residence in the country, proof of income, proof of health insurance, and any other supporting documents specific to your situation.", "You should prepare all necessary documents ahead of time, ensure they are up-to-date and valid, and organize them in a clear and logical manner. You should also review the application requirements and ensure you meet all eligibility criteria.", "This will depend on the specific application you are completing. Some common items include a completed application form, identification documents, proof of address, proof of income, and any additional documents specific to your application. Be sure to carefully review the application requirements to determine what you need."]
             },
            {"tag" : "Visa reason",
	         "patterns" : ["What happens if I dont apply for my Carte de sejour on time?","What happens if I dont apply for the resident card?","Why should I apply the resident card?","Why should I apply for the Titre de sejour?","The reason for applying the resident card."],
             "responses": ["If you don't apply for your Carte de sejour on time, you could face penalties such as fines or even deportation. Additionally, it could become more difficult to apply for the card later on, as you may need to prove that you have been residing in the country legally.","If your long-stay visa expires before you have applied, you will incur an extra fee of €180 (on top of the standard application fees), as well as risking being refused for overstaying your visa.","Applying for the resident card is important as it provides proof that you are legally residing in the country. This can help prevent legal issues or penalties down the line, and can also make it easier to access certain services such as healthcare or education.", "The reason for applying for the resident card is to provide proof that you are legally residing in the country. This can help prevent legal issues or penalties down the line, and can also make it easier to access certain services such as healthcare or education.", "Applying for a Carte de sejour can provide a number of benefits, including legal proof of residence, easier access to services such as healthcare and education, and the ability to legally work in the country. It can also help prevent legal issues or penalties down the line."]
             },
             {"tag": "housing", 
             "patterns": ["how to find a house in toulouse?", "where to find a house in toulouse?", "can i find a home in toulouse online?", "I need a house in toulouse", "how to find a student housing", "how to find a private apartment?", "can i find a shared apartement?", "Can i rent a studio house?", "houses near TBS", "is airbnb a valid housing option?", "is airbnb accepted as a valid student housing for visa?", "is the house furnished?", "is it easy to find a house in Toulouse?", "what is the average house rent in toulouse?", "when should i book a house", "what is the rent for a fully furnished house?", "how to pay the house rent?", "what is cold rent?", "what is warm rent?", "does TBS provide accommodation?", "is there accommodation from TBS?", "does TBS has on campus student accommodation?", "which is the ideal place in toulouse to stay?", "is there is waiting period for finding a house?", "what is the ideal time required to find a house in toulouse?"],
             "responses": ["you can easily find various housing options on the TBS website by logging into TBS Campus>International Support>Toulouse>Housing", "you can find housing in toulouse by various methods like through TBS website, through agency, online platforms, student residency partners, homestay partners ", "yes, you can find a house in toulouse online", "please mention the location you prefer in toulouse for housing", "you can find student houses from our student residencey partners", "you can find private apartments from housing agencies", " yes, you can find a shared apartment in a student housing accommodation", "you can rent a studio of your choice from our various housing partners", "there are plenty of housing options near TBS. you can consider sharing an apartment with other TBS students, which will be an affordable option", "Many students will book through Airbnb; however, it is important to note that housing via Airbnb is not recognized as an official accommodation and you will not have an accommodation contract. This can cause trouble for students wishing to apply for CAF allocation and open a bank account", "no, airbnb is not accepted as a valid proof of accomodation for visa", "Most furnished studios do not provide kitchenware or bed linen automatically. Some residences provide these for a small extra cost. Please check with the residence in advance.", "you can easily find a house in toulouse. TBS provides multiple options on C@ampus to help students find a house",
                        "average rent in toulouse is between 500-600 euros for a 1 bedroom apartment",
                        "it is advised to book an accommodation even before arriving in france",
                        "rent varies as per the area of the house. however on an average a fully furnished house in toulouse may cost around 600-800 euros",
                        "You can pay the house rent through bank transfer or direct debit to the lessor's registered bank account.",
                        "Cold rent means that you pay basic rent for the residence and there are no extra costs included in your monthly payment.",
                        "Warm rent means that your monthly payment includes the basic rent for the residence and additional costs.",
                        "no, TBS does not provide any accommodation, TBS only offers assistance to find an accommodation for students.",
                        "there is no on campus accommodation by TBS.",
                        "You can find a house in Toulouse in various neighborhoods and districts, such as Carmes, Saint-Cyprien, Purpan, or Compans-Caffarelli. It depends on your preferences and needs.",
                        "ideally it takes around 7-10 days to find an accommodation in toulouse.",
                        "Please remember that Toulouse welcomes more than 130,000 students every year. The agencies and residencies experience extreme peaks depending on the seasons. It is customary to wait 1 week -10 days before resending an email."]
            },
            {"tag": "TBS housing partners",
		     "patterns": ["what are TBS housing partners?", "how to find TBS partnered student housing options?", "does TBS has housing partners?", "does the housing partners charge a booking fee?", "do the housing partners charge for the service offered?", "are TBS housing partners genuine?"," what are types of housing partners available?", "how to find genuine housing partners?", "how to contact a housing partner?", "how do i get in touch with a housing partner?", "does TBS hosusing partners offer any discounts?", "is there any discounts for TBS students?", "Can i get a discount on the housing partner fee?"],
		     "responses": ["the housing agencies that are recognized by TBS are TBS housing partners", " you can find TBS partnered housing partners on the C@mpus space", "yes TBS has recognized housing partners to assist students find a house", "Yes, most housing partners require a security deposit to be paid at the beginning of the rental period. The amount of the deposit varies depending on the partner and the type of accommodation", "yes, they charge a small booking fee", "All TBS housing partners are vetted and validated by TBS to ensure their reliability. However, you can also check reviews from other students who have used the same housing partner before making a decision.", "TBS has various housing partners- Agency partners, student residency partners, online platform partners, homestay partners", "all the housing partners listed on TBS website are authentic. you can find them by going to TBS Campus>International Support>Toulouse>Housing>Housing Partners.", "there are different types of housing partners- Agency partners, student residency partners, online platform partners, homestay partners", "you can reach a housing partner through phone or by email. Remember to say you are a TBS Business School student when contacting your choice of accommodation. Some of our partnerships include discounts and other benefits such as exempting a French guarantor.", "you can contact a housing partner via phone or email", "TBS Business School has a wide range of partners, from online housing platforms to homestays with a family.", "as TBS student you can avail discounts and offers from TBS partnered housing agencies.", "yes TBS students are eligible for a discount", "as a TBS student you can get a discount"]
		    },
            {"tag" : "Housing contract and notice period",
		    "patterns": ["what is a housing contract?", "what is the minimum duration for contract?", "what is the notice period", "can i get individual contract in a shared apartment", "how long is the notice period?", "what is the maximum duration for a housing contract?",  "can the housing contract be extended?", "what is included in the housing contract?", "is a housing contract necessary for a student visa?", "do i have to pay rent during notice period?", "does the contract include vacation period?", "is TBS also included in the contract?", "what if I have to leave before the contract period?", "is it possible to close the contract before the contract period?"],
		    "responses": ["A housing contract is a legally binding document that sets out the terms and conditions for living in rented accommodation. The terms and conditions include the landlord and tenant's rights and obligations.",  "Housing contracts through student residences and rental agencies have a minimum duration of three months. Be sure to read your contract carefully before signing it. If you sign a contract for 1 year or 3 years, and you wish to leave sooner, please remember to send an official notice, 1 month prior to the departure date. This letter must be sent by registered mail.", "In Toulouse students can send a registered letter one month prior to their departure date. This will cancel the contract with no charges and no penalties. In other words, please dont be afraid to sign a contract for 1 year or 3 years. You can always cancel it with no fees and no obligations","yes, each tenant will have an individual contract, even in a shared apartment",
					"the notice period is usually 30 calendar days", 
					"the maximum duration of a housing contract is 12 months",
					"once expired, the housing contract can be renewed or extended upon tenants request",
					"the housing contract has the complete details about the lessor, tenant, rental duration, amount of rent, deposit amount...",
					"all International students are required to have a proof of accommodation for the student visa procedures",
					"notice period is generally the last month your stay in an accommodation and hence you have to pay rent during notice period as well",
					"no the contract does not include any vacation period and you are liable to pay the rent even during a vacation",
					"if your guarantor is TBS, then TBS is also a part of your housing contract",
					" you can leave before the contract period, provided you provide at least 30 days prior notice to your lessor.",
					"you are allowed to close the contract before, provided the lessor is given a month prior notice."]
            },
            {"tag": "guarantor ",
             "patterns": ["what is a guarantor?", "who is a guarantor?",  "how to find a guarantor?", "where can i find a guarantor", "is a guarantor mandatory", "is to compulsory to have a guarantor?", "can international students get guarantors?", "can TBS act as a guarantor?", "how can International students find a guarantor", "are international students exempt from having a guarantor?", "is studapart a valid guarantor?", "who is a valid guarantor?", "does the guarantors charge a fee?"],
             "responses": ["The 'garant' is a co-signer on your lease. In the case that you are unable to pay your monthly rent, the 'garant' becomes legally responsible. Some residences require a 'garant', a guarantor to sign the contract to guarantee against the eventuality of unpaid rent. As the 'guarantor' must typically reside in France, international students have problems finding a guarantor. To facilitate this procedure, TBS is working alongside three axes, each of these axes will help you overcome the problematic of a 'garant' during the reservation process.", "there are 3 ways to find a guarantor : TBS Bilateral housing protocol : This is a document that is signed by three parties: TBS, the student and the residency (in which TBS has a bilateral agreement). As of today, there is a bilateral housing protocol (agreement statement) for exchange students who are legally registered at a partner institution. Our legal department is drafting an agreement statement for the full-time international students registered uniquely to a French institution. We will inform you once it has been established and approved by all parties",
                           "Garant providers - There are three main actors who provide a guarantor service. Studapart can act as a garant for a small fee (roughly 150 euro per semester). Some providers are free of charge such at Visale, a state-run insurance policy. Please note with Visale the process can take up to a week. We strongly suggest that you start this process before you arrive and finish it when you are in Toulouse. Lastly, there is Garantme, is another option in which money is blocked on a neutral account to ensure that rent is paid on time. TBS advises that you verify with the landlord or residence before purchasing or using one of the providers. It is not mandatory for landlords and residencies to accept these providers.", "International garant - Some residencies or internationally-orientated landlords will accept an international guarantor. For this, you need to supply the landlord or residence with a copy of the guarantor's passport, the 3 last pay stubs from the guarantor (parents, legal guardian or friend) and last year's tax statement, if the person actively pays taxes.",
                           "yes, having a guarantor is mandatory while renting a home in france",
                           "yes, TBS can act as a guarantor. TBS Bilateral housing protocol is a document that is signed by three parties: TBS, the student and the residency (in which TBS has a bilateral agreement). As of today, there is a bilateral housing protocol (agreement statement) for exchange students who are legally registered at a partner institution. Our legal department is drafting an agreement statement for the full-time international students registered uniquely to a French institution. We will inform you once it has been established and approved by all parties.",
                           "no, all international students studying in france are required to have a valid guarantor",
                           "studapart is a registered and a valid guarantor.", "any guarantor who is registered with the state is a valid guarantor",
                           "if the guarantor is TBS there is no fee charged. however a few private guarantors do charge a small fee."]
            },
            {"tag": "housing insurance",
             "patterns": ["what is a housing insurance", "how to purchase a housing insurance?", "is it mandatory to have a housing insurance in france?", "is home insurance free?", "what is the cost of house insurance in France?", "is there an exemption from housing insurance?", "can i buy a housing insurance online?", "can the home insurance be purchased online?", "can the housing and health insurance be clubbed?", "should i have a dedicated housing insurance?", "is there a tax on the housing insurance?", "is the home insurance taxable?"],
             "responses": ["A housing insurance covers you for loss or damage to personal possessions in the event of fire, theft, flooding and similar incidents. It covers all your personal belongings – anything not physically attached to the building - against the cost of loss or damage.",
                       "Some residences sell house insurance, or you can check out the TBS partner Get Luko. This is an online service and students can pay with an international bank card. For more information please visit the Insurance section.",
                       "According to French Law, everybody must have house insurance before moving into new accommodation. All tenants must have housing insurance (assurance habitation).",
                       "No. house insurance is not free. however, you easily can purchase a house insurance from TBS partner Get Luko",
                       "Generally, yearly premiums start at around €100-150 but can cost €500 or more for expensive properties. Average costs in France in 2020 were €248, but that varied between around €200 and €300 across different regions.",
                       "there is no exemption from house insurance. it is mandatory to have a home insurance in france.", 
                       "housing insurance can be purchased from a variety of sources, online as well.",
                       "it is essential to have a dedicated insurance for your house.",
                       "you're required to have a dedicated home insurance",
                       "there is a house tax in france, however your house insurance is not taxed."]
            },
            {"tag": "security deposit",
             "patterns": ["what is a security deposit?", "is it mandatory to pay security deposit?", "when should i pay the security deposit?", "will the security deposit be refunded?", "is security deposit refundable?", "when is the security deposit refunded?", "Will there be deductions from the deposit amount?", "is the security deposit subject to deductions?", "what is the amount for security deposity?"],
             "responses": ["The security deposit is a sum you pay your owner when you sign your lease agreement and that he keeps temporarily. It's not mandatory by law, but owners have the right to require it and virtually always do. The amount and conditions surrounding the deposit must be specified in your lease agreement.",
                        "The landlord may require the payment of a security deposit to cover possible breaches of the tenant (rents or unpaid charges, realization of rental repairs ...). For furnished apartments that charge a monthly rent, a security deposit of 2 months'rent is common practice. If the apartment is unfurnished, then students may be asked to pay 1 month of rent as a security deposit.",
                        "The security deposit must be paid to the landlord at the time of the signing of the lease, directly by the student. If the payment is made in cash, then the student should request a receipt or proof of payment which specifies the sum of the security deposit.",
                        "The security deposit should be refunded within one month upon rightful termination of the lease. Deductions of the security deposit can include: unpaid charges or costs related to degradations or rental work. All deductions must be justified by the landlord through written documents. Invoices, estimates and cost should be included in the deductions report.",
                        "The security deposit is generally refunded at the end of the contract",
                        "Usually the security deposit is refund portion of the security deposit maybe be deducted if there are any damages done or maintenance required to the apartment",
                        "The security deposit amount is mostly 2 months rent. sometimes the lessor may charge just a month's rent as well as deposit."]
            },
            {"tag" : "Visa application",
	         "patterns" : ["Where should I apply for residence?","Where should I apply for a resident card?","How can I apply for a resident card?","Where to apply for my first resident card?","Where should I apply for my first Carte de sejour?","Where to apply for my first Titre de sejour?","Where should I apply for a resident permit?","How can I have my permit to stay in France?","How can I have my resident card to stay in France?","How can I have my Titre de sejour to stay in France?","Where to apply for my first resident permit?","Where to apply for the permit to stay in France?"],
             "responses": ["You can apply it on this website: https://administration-etrangers-en-france.interieur.gouv.fr/particuliers/#/ (click 'Je demande ou renouvelle un titre de sejour')","On the website https://administration-etrangers-en-france.interieur.gouv.fr/particuliers/#/ you can see it.", "you can apply for a residence card on the resident card website", "a resident card can be obtained from the france resident card website", "you can apply for your first resident card from the france visa website>resident card", "you can apply for your first resident card on the france visa website", "you can apply for your first titre sejour on the carte de sejour website"]
             },
            {"tag" : "Visa time",
	         "patterns" : ["When do I need to submit the application?","When should I apply for residence?","When should I apply for a resident card?","When to apply for my first resident card?","When should I apply for my first Carte de sejour?","When to apply for my first Titre de sejour?"],
             "responses": ["You can start the application within two months of the end of your long-stay visa and must apply before your visa expires.","At least two months before your visa expires."]
             },
            {"tag" : "Visa document",
	         "patterns" : ["What documents do I need to apply?","Required documents for Carte de sejour application?","Required documents for the application?","Required documents for the resident card application?","What should I prepare for the application?","Things I need for the application?","What do I need to prepare before?"],
             "responses": ["Your long-stay visa or current carte de sejour, your passport, your full birth certificate (translated into French), proof of address (dated less than six months old), 3 x passport-style photos, OFII medical certificate"]
             },
            {"tag" : "Visa reason",
	         "patterns" : ["What happens if I don't apply for my Carte de sejour on time?","What happens if I don't apply for the resident card?","Why should I apply the resident card?","Why should I apply for the Titre de sejour?","The reason for applying the resident card."],
             "responses": ["If your long-stay visa expires before you've applied, you will incur an extra fee of €180 (on top of the standard application fees), as well as risking being refused for overstaying your visa.","Pay and say bye.","Say Goodbye France."]
             },
            {"tag" : "Visa after application",
	         "patterns" : ["What should I do after I apply?","What should I do after I apply?","What should I do after the application?","How long should I wait for my resident carte?","I received a recepisse, what is it?","Do I need do anything else while waiting?"],
             "responses": ["Once you have filled in your application online, you will be invited to attend an appointment at your local prefecture. You will also be issued a list of documents to bring, such as the one above.During the interview, you will be asked to present all your documents and your photos, sign various documents, and - assuming your application is accepted, you will be given a receipt De Demande De Carte De Sejour. Hold onto this document as it is the official 'receipt' of your application and will serve as your proof of residency up until you receive your carte de sejour.After the interview, your resident card(carte de sejour) will either be sent to you or will be available for you to pick up from the prefecture. This may take anything from three weeks to a few months, depending on the prefecture - you should be given an idea of the timeframe at your appointment."]
             },
             { "tag" : "account",
               "patterns" : [ "I cannot open my Ameli account, what should I do?", "My ameli account is not activated yet, What am I supposed to do?", "Ameli account is temporarily unavailable", "I had a problem while activating my Ameli account", "how do I activate my Ameli account", "I can't create my Ameli account how to do it", "IMPOSSIBLE TO CONNECT ME ON AMELI, WRONG SOCIAL SECURITY NUMBER", "Unable to access my AMELI account: Forgot password","WHY AM I BLOCKED FROM CREATING MY AMELI ACCOUNT?", "I STILL HAVE NOT RECEIVED A CONFIRMATION EMAIL TO CREATE AN AMELI ACCOUNT?"],
               "responses": [ "first of all check if you input the right mail and password, if this is the case, type your name, social security number and phone number and we will call you in the next 10 days", "You should come to our office if it is your first time",  "You should come to our office if it is your first time",  "You should come to our office if it is your first time",  "first of all you should have a social security number, and then you can open your Amelia account",  "You should come to our office if it is your first time", " everyone have a dedicated social security number, therefore you cannot have a wrong social number, check that you are typing it right", "if you forgot your password, you can simply change it by folllowing the steps of 'forgot my password'", "if you are blocked that means that something wrong in your account, provide us with your name, social security number, and phone number", " for you to have another confirmation email, you should comme to our offices"]
            },
            { "tag" : "refund",
                "patterns": ["I did not get my refund yet, what should I do", "CAN YOU BE ENTITLED TO FINANCIAL ASSISTANCE FROM SOCIAL SECURITY WHILE WAITING FOR DAILY BENEFITS?", "Can a sector 2 doctor exceed fees?", "HEALTH INSURANCE FOR NON-RESIDENT EUROPEANS?", "REIMBURSEMENT WITH CERTIFICATE OF PROVISIONAL RIGHTS?", "REIMBURSEMENT OF EXPENSES ABROAD", "Is mutual necessary or no?"],
                "responses":["you should check your Ameli account by signing in, if not come to our offices", "If you have an ameli account, you can consult in the section 'my steps in 2 clicks' the processing times of your CPAM for requests", "A sector 2 doctor can exceed fees in the event of third-party payment for maternity / ALD, but only on the enforceable tariff.", "If your came to France as part of a stay and does not intend to reside there on a stable and regular basis, you must contact her social security fund in her country to find out whether this care in France can be covered.", "The provisional social security number assigned to you allows you to benefit from the same rights as if you were in possession of a definitive number. However, while waiting for the final number, you cannot have a Vitale card or create your ameli account.", "You will be reimbursed on the basis of the rates in force in the State of stay and within the limit of the expenses incurred. You can choose to be reimbursed according to French legislation by indicating this on form S3125.", "Certain acts and overruns not covered by health insurance can be reimbursed by a complementary option.I invite you to consult the page of the ameli.fr site on Long-term affection."]
            },
            {"tag":"student",
            "patterns":["FOREIGN TRAINEE INSURANCE INFO", "International STUDENT, COMING TO DO A 6-MONTH END-OF-STUDY INTERNSHIP IN FRANCE", "I AM A STUDENT AND BACK IN FRANCE AFTER 3 YEARS AND I WOULD LIKE TO REOPENE MY RIGHTS", "CHANGING 'THE START DATE OF YOUR HEALTH INSURANCE RIGHTS","INTERNSHIP WITHOUT SOCIAL SECURITY IS THIS POSSIBLE?'", "I AM A FOREIGN STUDENT, I HAVE TO RENEW MY STAY AND I STILL HAVE NOT RECEIVED THE DEFINITIVE ENTRANCE CERTIFICATE?"],
            "Responses":["This question has been discussed on the forum. To know the answer, I invite you to consult this topic entitled How to be insured in France?.", "You will find useful information in this article from the center of European and international social security links (Cleiss): Come and do an internship in France.", "This question has been discussed on the forum. To know the answer, I invite you to consult this topic entitled Health coverage for a student.", "However, as part of our privacy policy, all questions involving the exchange of personal information and access to your file cannot be dealt with on this forum.", " A user has encountered the same problem as you on this forum. I invite you to read this answer concerning the provisional social security number.", "As a first step, I invite you to consult the answer given on this topic entitled How long does it take to obtain a definitive social security number?."]
            },
            {"tag": "greeting",
                "patterns": ["hey", "hi", "hii", "hello", "good morning", "good evening", "good afternoon"],
                "responses": ["hey", "hi", "hii", "hello", "good morning", "good evening", "good afternoon"]
            },
            {"tag": "goodbye",
             "patterns": ["bye", "goodbye", "see you"],
             "responses": ["bye","goodbye", "see you"]
            },
            {"tag": "thanks",
             "patterns": ["Thank you", "Thanks", "Thank you for your help"],
             "responses": ["You are welcome","Welcome", "Glad to help! Welcome"]
            }
            


        ]
    }


